# This notebook needs to be annotated for clarity

## Will annotate once results are betters

In [1]:
# This Python 3 environment comes with many helpful analytics libraries installed
# It is defined by the kaggle/python docker image: https://github.com/kaggle/docker-python
# For example, here's several helpful packages to load in 

import numpy as np # linear algebra
import pandas as pd # data processing, CSV file I/O (e.g. pd.read_csv)

# Input data files are available in the "../input/" directory.
# For example, running this (by clicking run or pressing Shift+Enter) will list the files in the input directory

from subprocess import check_output
print(check_output(["ls", "../input"]).decode("utf8"))

# Any results you write to the current directory are saved as output.

gender_submission.csv
test.csv
train.csv

In [2]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
%matplotlib inline

In [3]:
test=pd.read_csv('../input/test.csv')
train=pd.read_csv('../input/train.csv')
train.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [4]:
print(test.shape, train.shape)

(418, 11) (891, 12)

In [5]:
train.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [6]:
m_1=train[train['Pclass']==1]['Age'].median()
m_2=train[train['Pclass']==2]['Age'].median()
m_3=train[train['Pclass']==3]['Age'].median()
fm_1=test[test['Pclass']==1]['Age'].median()
fm_2=test[test['Pclass']==2]['Age'].median()
fm_3=test[test['Pclass']==3]['Age'].median()



def imputeage(cols):
    Age=cols[0]
    Pclass=cols[1]
    
    if pd.isnull(Age):
        if Pclass ==1:
            return m_1
        elif Pclass ==2:
            return m_2
        else:
            return m_3
        
    else:
        return Age


def imputeagef(cols):
    Age=cols[0]
    Pclass=cols[1]
    
    if pd.isnull(Age):
        if Pclass ==1:
            return fm_1
        elif Pclass ==2:
            return fm_2
        else:
            return fm_3
        
    else:
        return Age

In [7]:
train['Age']=train[['Age','Pclass']].apply(imputeage,axis=1)
test['Age']=test[['Age','Pclass']].apply(imputeagef,axis=1)

In [8]:
from sklearn.preprocessing import LabelEncoder
sex_encoder=LabelEncoder()

sex_encoder.fit(list(train['Sex'].values) +list(test['Sex'].values))

LabelEncoder()

In [9]:
train['Sex']=sex_encoder.transform(train['Sex'].values)
test['Sex']=sex_encoder.transform(test['Sex'].values)

In [10]:
train.drop('Cabin',axis=1,inplace=True)
test.drop('Cabin',axis=1,inplace=True)

In [11]:
test.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Embarked
0,892,3,"Kelly, Mr. James",1,34.5,0,0,330911,7.8292,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",0,47.0,1,0,363272,7.0000,S
2,894,2,"Myles, Mr. Thomas Francis",1,62.0,0,0,240276,9.6875,Q
3,895,3,"Wirz, Mr. Albert",1,27.0,0,0,315154,8.6625,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",0,22.0,1,1,3101298,12.2875,S

In [12]:
import re

In [13]:
def title_extract(name):
    x =re.search(', (.+?)\.', name)
    if x:
        return x.group(1)
    else:
        return ''

In [14]:
test['Title']=test['Name'].apply(title_extract)
train['Title']=train['Name'].apply(title_extract)

In [15]:
train.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Embarked,Title
0,1,0,3,"Braund, Mr. Owen Harris",1,22.0,1,0,A/5 21171,7.2500,S,Mr
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",0,38.0,1,0,PC 17599,71.2833,C,Mrs
2,3,1,3,"Heikkinen, Miss. Laina",0,26.0,0,0,STON/O2. 3101282,7.9250,S,Miss
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",0,35.0,1,0,113803,53.1000,S,Mrs
4,5,0,3,"Allen, Mr. William Henry",1,35.0,0,0,373450,8.0500,S,Mr

In [16]:
train['Embarked']=train['Embarked'].fillna('Z')

In [17]:
fm=test['Fare'].median()
test['Fare']=test['Fare'].fillna(fm)

In [18]:
from sklearn.ensemble import RandomForestClassifier

In [19]:
from sklearn.feature_extraction import DictVectorizer

In [20]:
feature_names = ['Pclass', 'Sex', 'Age', 'SibSp', 'Parch', 'Fare', 'Title', 'Embarked']
dv=DictVectorizer()
dv.fit(train[feature_names].append(test[feature_names]).to_dict(orient='records'))
dv.feature_names_

['Age',
 'Embarked=C',
 'Embarked=Q',
 'Embarked=S',
 'Embarked=Z',
 'Fare',
 'Parch',
 'Pclass',
 'Sex',
 'SibSp',
 'Title=Capt',
 'Title=Col',
 'Title=Don',
 'Title=Dona',
 'Title=Dr',
 'Title=Jonkheer',
 'Title=Lady',
 'Title=Major',
 'Title=Master',
 'Title=Miss',
 'Title=Mlle',
 'Title=Mme',
 'Title=Mr',
 'Title=Mrs',
 'Title=Ms',
 'Title=Rev',
 'Title=Sir',
 'Title=the Countess']

In [21]:
rfor=RandomForestClassifier(random_state=40, n_estimators=300, max_depth=5)
X_train=dv.transform(train[feature_names].to_dict(orient='records'))
y_train=train['Survived']
X_test=dv.transform(test[feature_names].to_dict(orient='records'))
rfor.fit(X_train,y_train)

RandomForestClassifier(bootstrap=True, class_weight=None, criterion='gini',
            max_depth=5, max_features='auto', max_leaf_nodes=None,
            min_impurity_decrease=0.0, min_impurity_split=None,
            min_samples_leaf=1, min_samples_split=2,
            min_weight_fraction_leaf=0.0, n_estimators=300, n_jobs=1,
            oob_score=False, random_state=40, verbose=0, warm_start=False)

In [22]:
pred=rfor.predict(X_test)

In [23]:
pred.shape

(418,)

In [24]:
my_predicitons=pd.DataFrame()
my_predicitons['PassengerId']=test['PassengerId']
my_predicitons['Survived']=pred
my_predicitons.head()

   PassengerId  Survived
0          892         0
1          893         1
2          894         0
3          895         0
4          896         1

In [25]:
my_predicitons.to_csv('My_RF_titanic_predictions', index=False)